[
    {
      "buylink": "https://www.amazon.in/Yuktahaar-Belly-Brain-Munmun-Ganeriwal/dp/0143454382/ref=sr_1_1_sspa?crid=28NCIA9GROBOP&keywords=books+for+fitness&qid=1665474191&qu=eyJxc2MiOiIxLjk5IiwicXNhIjoiMC44MSIsInFzcCI6IjAuMDAifQ%3D%3D&sprefix=books+for+fitness%2Caps%2C693&sr=8-1-spons&psc=1&spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUFUTlNXR0xPWTdKREQmZW5jcnlwdGVkSWQ9QTA5Mzc1OTUyTkRIWEIwWUE5OVNTJmVuY3J5cHRlZEFkSWQ9QTA4ODQ0MTIxUTNVVUw4SEJQQjQmd2lkZ2V0TmFtZT1zcF9hdGYmYWN0aW9uPWNsaWNrUmVkaXJlY3QmZG9Ob3RMb2dDbGljaz10cnVl",
      "bookcover": "https://m.media-amazon.com/images/I/41+SXhBXMNL._SX321_BO1,204,203,200_.jpg",
      "bookname": "Yuktahaar: The Belly and Brain Diet",
      "bookdetails": "Have you ever wondered why diets just don't seem to work? In Yuktahaar, celebrity nutritionist Munmun Ganeriwal argues that the reason why none of the diets in the past have seemed to work is because they focused on the wrong cause-you, the reader. While we may continue to have a fling with low carb, vegan, low fat diets and everything in between but a long-lasting solution may never be found if we do not shift our focus from 'you' to 'them'-the human-gut microbiome connection. Nearly all chronic issues are rooted in an imbalanced microbiome. Disruption in the balance of your belly-based microscopic community not only causes weight gain and increases the risk of chronic diseases but also impacts our mood, behavior, happiness, and a general sense of well-being. In this book, Munmun gives an actionable 10-week holistic program that encourages a gut balancing lifestyle, consisting of season-wise meal plans, recipes, exercise routines, sleep hygiene tips, and yoga practice. The book also charts actress Taapsee Pannu's phenomenal physical transformation while working with Munmun. With a focus on combining traditional, regional Indian foods with evidence-backed tips, Yuktahaar will transform your relationship with food and rebalance your gut for a leaner and healthier you.",
      "ratings": "4.4 out of 5",
      "author": "Winner of the 'Award for the Best Nutritionist' by Femina, Munmun Ganeriwal, is a renowned and celebrated Lifestyle consultant in the field of Functional Medicine. She is the only gut microbiome specialist in the world who combines traditional Indian foods, ancient Indian yogic practices and gut microbiota study to understand and fight obesity and other diseases. Her clientele includes Taapsee Pannu, Rakul Preet Singh, Nayanthara, Ekta Kapoor and many more."
    },
    {
      "buylink": "https://www.amazon.in/12-Week-Fitness-Project-Rujuta-Diwekar/dp/9353450888/ref=sr_1_3?crid=28NCIA9GROBOP&keywords=books+for+fitness&qid=1665474191&qu=eyJxc2MiOiIxLjk5IiwicXNhIjoiMC44MSIsInFzcCI6IjAuMDAifQ%3D%3D&sprefix=books+for+fitness%2Caps%2C693&sr=8-3",
      "bookcover": "https://m.media-amazon.com/images/I/41j4eJBSI1L._SX322_BO1,204,203,200_.jpg",
      "bookname": "The 12-Week Fitness Project",
      "bookdetails": "Lose inches. Gain health. Sleep better. In just 12 weeks. Want to get fit but don’t know how to start? Let India’s #1 nutritionist and health advocate Rujuta Diwekar help you. In this ground-breaking book, based on the ‘12-week fitness project’, one of the world’s largest and most successful public health projects, she will guide you step by step, giving you one simple guideline to follow each week. By the end of three months you will have transformed your habits in twelve crucial ways. The result? You’ll find you have lost inches and have better sleep and energy levels, lesser acidity, bloating and sweet cravings and reduced PMO and period pain.",
      "ratings": "4.4 out of 5",
      "author": "Rujuta Diwekar is one of India’s top nutritionists and the author of bestselling books such as Don’t Lose Your Mind, Lose Your Weight and Indian Superfoods."
    },
    {
      "buylink": "https://www.amazon.in/New-Encyclopedia-Modern-Bodybuilding-Updated/dp/0684857219/ref=sr_1_5?crid=28NCIA9GROBOP&keywords=books+for+fitness&qid=1665474191&qu=eyJxc2MiOiIxLjk5IiwicXNhIjoiMC44MSIsInFzcCI6IjAuMDAifQ%3D%3D&sprefix=books+for+fitness%2Caps%2C693&sr=8-5",
      "bookcover": "https://m.media-amazon.com/images/I/51W9o9b28+L._SX383_BO1,204,203,200_.jpg",
      "bookname": "The New Encyclopedia of Modern Bodybuilding",
      "bookdetails": "A book specifically written for anyone who enjoys working with weights or who simply likes keeping fit and healthy, The New Encyclopaedia Of Modern Body Building has earned its reputation of being the holy grail of bodybuilding.",
      "ratings": "4.6 out of 5",
      "author": "A famous Hollywood actor starring in movies like The Terminator Series, The Predator and Junior among others, Arnold Schwarzenegger is a man of many talents. He is also a bestselling author who came out with his first book in 1977. He had also served as the Governor of California from 2003 to 2011."
    },
    {
      "buylink": "https://www.amazon.in/FITNESS-HABITS-Breaking-Barriers-Fitness/dp/939044120X/ref=sr_1_9?crid=28NCIA9GROBOP&keywords=books+for+fitness&qid=1665474191&qu=eyJxc2MiOiIxLjk5IiwicXNhIjoiMC44MSIsInFzcCI6IjAuMDAifQ%3D%3D&sprefix=books+for+fitness%2Caps%2C693&sr=8-9",
      "bookcover": "https://m.media-amazon.com/images/I/41L3I2RiB4L._SX322_BO1,204,203,200_.jpg",
      "bookname": "FITNESS HABITS: Breaking the Barriers to Fitness",
      "bookdetails": "Who doesn’t want to be fitter! We all do, and we want instant results. Most of us struggle to make place for fitness into our lifestyle due to lack of time, motivation and the right direction. So many of us start enthusiastically, but give up somewhere along the way. If you have tried to keep pace with fitness and faced obstacles in sticking to it, this book is a step-by-step guide for you to win the game and make it a part of your day-to-day life. FITNESS HABITS is a compilation of a wealth of research and studies that challenge the most common notions about fitness. This book suggests sure-fire ways to stick to your fitness routine and helps you to create an urge to go back to your fitness routine – every single day. • Learn to acknowledge your failure in fitness as your progress and get motivated to continue. • Ready reference for beginners, those who started in the past but couldn’t continue, and those who have an on-and-off relationship with fitness. • Find an integrated model that will change the way you perceive fitness and help you make fitness a habit. An operating manual that gives you tried and tested methods of making fitness a habit.",
      "ratings": "4.2 out of 5",
      "author": "Amaresh Ojha"
    },
    {
      "buylink": "https://www.amazon.in/Basics-Gym-Fitness-guidance-nutrition/dp/164546153X/ref=sr_1_10?crid=28NCIA9GROBOP&keywords=books+for+fitness&qid=1665474191&qu=eyJxc2MiOiIxLjk5IiwicXNhIjoiMC44MSIsInFzcCI6IjAuMDAifQ%3D%3D&sprefix=books+for+fitness%2Caps%2C693&sr=8-10",
      "bookcover": "https://m.media-amazon.com/images/I/41oV6oFP1hL._SX332_BO1,204,203,200_.jpg",
      "bookname": "Basics of Gym and Fitness",
      "bookdetails": "Basics of Gym and Fitness: In depth look and guidance for gym and nutrition",
      "ratings": "3.7 out of 5",
      "author": "Born in Pune, India and having an inclination towards writing, is a lawyer by qualification having experience in business and social work. Is a fitness professional and writer. Writes fitness and nutrition based books along with fiction and non fiction work which is under process and will be coming out with fiction work soon."
    },
    {
      "buylink": "https://www.amazon.in/Eat-Up-Clean-Personal-Journey/dp/9390183820/ref=sr_1_11_sspa?crid=28NCIA9GROBOP&keywords=books+for+fitness&qid=1665474191&qu=eyJxc2MiOiIxLjk5IiwicXNhIjoiMC44MSIsInFzcCI6IjAuMDAifQ%3D%3D&sprefix=books+for+fitness%2Caps%2C693&sr=8-11-spons&psc=1&spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUFUTlNXR0xPWTdKREQmZW5jcnlwdGVkSWQ9QTA5Mzc1OTUyTkRIWEIwWUE5OVNTJmVuY3J5cHRlZEFkSWQ9QTAwNzgxMTc2R1pIQUVQTFZHUU4md2lkZ2V0TmFtZT1zcF9tdGYmYWN0aW9uPWNsaWNrUmVkaXJlY3QmZG9Ob3RMb2dDbGljaz10cnVl",
      "bookcover": "https://m.media-amazon.com/images/I/41+kY+2yhAL._SX460_BO1,204,203,200_.jpg",
      "bookname": "Eat Up, Clean Up",
      "bookdetails": "Today, everyone is an expert on losing weight and eating right. Foods fall in and out of trend faster than shoes. In this cacophony of voices, it is relatively easy to Hop from one crash diet to another in our never-ending obsession with being thin. Our compromises with food have left us prone to a wide range of lifestyle-induced diseases. Whether it is pcos or hypertension or cancer, these are all a direct result of our way of living and eating. Since there are no apparent symptoms, we ignore, overlook, and carry on—on caffeine and packaged pasta. But what we don’t realise is that the mysteries of a healthy and fit body lie in our traditional meals and cooking methods rather than the next crazy diet fad on social media. A book on nutrition, health, and disease reversal, eat up, clean up uses stories of people around you, people you know, to hammer home a critical point: small changes give you significant results. This book attempts to make you think long and hard about your dietary choices and how you perceive health and well-being. It doesn't speak of any wonder foods or supplements that will magically make you Fitter and your body more robust, rather it’ll urge you to cook your own food the way it was done in the good old days. . . Since there aren't any shortcuts to health.",
      "ratings": "4 out of 5",
      "author": "Manjari wears many hats, including those of a functional nutritionist, wellness coach, entrepreneur, speaker, author, and most importantly a mother. Having worked for many of India’s leading hospitals such as Max Healthcare, Manipal Hospital, and Columbia Asia while running her own platform of Manjari Wellness, she has dedicated her career to changing her patients’ lives by reversing their diseases using modern science and blending it with ancient Indian wisdom, curative herbs along with aiding inclusive health. For her work in the field of nutritional science and entrepreneurship, she has been felicitated with numerous awards such as the ASSOCHAM award for ‘Popular Consultant in the field of Wellness and Nutrition’, the CMO ASIA World Leadership Award for ‘Women Super Achiever’, and the ET NOW Stars of the Industry Awards for ‘Woman Leadership’."
    },
    {
      "buylink": "https://www.amazon.in/Complete-Book-Yoga-Karma-Bhakti/dp/9389178789/ref=sr_1_12_sspa?crid=28NCIA9GROBOP&keywords=books+for+fitness&qid=1665474191&qu=eyJxc2MiOiIxLjk5IiwicXNhIjoiMC44MSIsInFzcCI6IjAuMDAifQ%3D%3D&sprefix=books+for+fitness%2Caps%2C693&sr=8-12-spons&psc=1&spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUFUTlNXR0xPWTdKREQmZW5jcnlwdGVkSWQ9QTA5Mzc1OTUyTkRIWEIwWUE5OVNTJmVuY3J5cHRlZEFkSWQ9QTEwMjkyNzkyUlNNOFVLUURZU1k1JndpZGdldE5hbWU9c3BfbXRmJmFjdGlvbj1jbGlja1JlZGlyZWN0JmRvTm90TG9nQ2xpY2s9dHJ1ZQ==",
      "bookcover": "https://m.media-amazon.com/images/I/41sWEKewjdS._SX460_BO1,204,203,200_.jpg",
      "bookname": "The Complete Book of Yoga",
      "bookdetails": "“All knowledge that the world has ever received comes from the mind...” in the quest for understanding one’s own mind, body, and soul, and to attain liberation, each man seeks spirituality as per his own means and understanding. Yoga, with its origin dating back to ancient India, has always been considered a pathway of achieving moksha. This edition combines the four paths of yoga as expounded by Swami Vivekananda in the nineteenth century. They include the three yogas mentioned in the Bhagat gita—karma yoga, bhakti yoga, and jnāna yoga—and Raja yoga, which is based on Maharshi Patanjali’s yoga sutras, and together they speak to the active, the emotional, the mystic, and the philosophical inside us. Complete with timeless universal wisdom, and not restricted to as an as and physical exercises, The yogic practices explained by Vivekananda become a way of life and hence lead to the realisation of the absolute.",
      "ratings": "4.6 out of 5",
      "author": "Born Narendranath Datta (1863-1902) in Calcutta, capital of British India, Swami Vivekananda belonged to a traditional aristocratic Bengali Kayastha family. Spiritual from an early age, Vivekananda was fascinated by wandering monks and used to practise meditation. He met Ramakrishna in around 1882. It came about as a life-changing experience for him and he eventually became his notable disciple. After Ramakrishna’s death, Vivekananda, along with other disciples, set up the Ramakrishna Math at Baranagar. In December 1886, they all took monastic vows. It was then that he took the name ‘Swami Vivekananda’. He played a major role in introducing yoga and the Vedanta philosophies to the West. It is because of him that Hinduism gained the status of a major world religion. His birthday is observed as the National Youth Day in India and the day he delivered his famous speech at the Parliament of World Religions, September 11, is commemorated as the World Brotherhood Day."
    },
    {
      "buylink": "https://www.amazon.in/12-Week-Fitness-Project-Hindi/dp/9353451078/ref=sr_1_14?crid=28NCIA9GROBOP&keywords=books+for+fitness&qid=1665474191&qu=eyJxc2MiOiIxLjk5IiwicXNhIjoiMC44MSIsInFzcCI6IjAuMDAifQ%3D%3D&sprefix=books+for+fitness%2Caps%2C693&sr=8-14",
      "bookcover": "https://m.media-amazon.com/images/I/41NdDhaIFVL._SX321_BO1,204,203,200_.jpg",
      "bookname": "The 12-Week Fitness Project",
      "bookdetails": "Lose inches. Gain health. Sleep better. In just 12 weeks. Want to get fit but don’t know how to start? Let India’s #1 nutritionist and health advocate Rujuta Diwekar help you. In this ground-breaking book, based on the ‘12-week fitness project’, one of the world’s largest and most successful public health projects, she will guide you step by step, giving you one simple guideline to follow each week. By the end of three months you will have transformed your habits in twelve crucial ways. The result? You’ll find you have lost inches and have better sleep and energy levels, lesser acidity, bloating and sweet cravings and reduced PMO and period pain.",
      "ratings": "4.2 out of 5",
      "author": "Rujuta Diwekar is one of India’s top nutritionists and the author of bestselling books such as Don’t Lose Your Mind, Lose Your Weight and Indian Superfoods."
    },
    {
      "buylink": "https://www.amazon.in/FIFTY-DAYS-FITNESS-FREAK-LIFE/dp/1647836506/ref=sr_1_15?crid=28NCIA9GROBOP&keywords=books+for+fitness&qid=1665474191&qu=eyJxc2MiOiIxLjk5IiwicXNhIjoiMC44MSIsInFzcCI6IjAuMDAifQ%3D%3D&sprefix=books+for+fitness%2Caps%2C693&sr=8-15",
      "bookcover": "https://m.media-amazon.com/images/I/41LwhGro7rL._SX311_BO1,204,203,200_.jpg",
      "bookname": "FIFTY DAYS TO FITNESS",
      "bookdetails": "You are lucky! Otherwise, you would not have seen this book. So, what is unique about 50 Days to Fitness? There are many wellness books in the market. Then, why this? It merely shows some down to earth and simple techniques to keep your most precious possession, your body, in ship shape. By spending just 2% of your time, i.e., 30 minutes a day for 50 days, you will surely witness a dramatic improvement in your wellness and fitness. These seemingly simple endurance workouts are so powerful that they can penetrate even your genes. A weekly action plan has been added to help busy people like you.Nowadays, it is impossible to eat an ideal diet due to many constraints. In the chapter 'On Food, ' we have shown how to squeeze in supplements to compensate lack of nutrition.As part our endeavor to care for the youth, we have included two chapters for IT professionals and students.By the way, what is wellness? Instead of quoting scriptures or treatises, let us put it directly with a pragmatic prejudice -'No frequent indispositions, no fatigue, always cheerful, bubbling with energy to do any work; if you see all these in a person, you can surely call him/her healthy and well or hale and hearty. Be such a one. Now, you know why you are lucky!",
      "ratings": "3.9 out of 5",
      "author": "Has been writing fitness articles since 2015 and has been working in the fitness industry since then."
    },
    {
      "buylink": "https://www.amazon.in/Cognitive-Fitness-Inevitable-Alleviate-Advantage/dp/0648565882/ref=sr_1_16?keywords=books+for+fitness&qid=1665490210&qu=eyJxc2MiOiIxLjk5IiwicXNhIjoiMC44MSIsInFzcCI6IjAuMDAifQ%3D%3D&sr=8-16",
      "bookcover": "https://m.media-amazon.com/images/I/41UDCYaz1-L._SX322_BO1,204,203,200_.jpg",
      "bookname": "Cognitive Fitness",
      "bookdetails": "The motivation to experience pleasure instead of pain unites us all, despite the immense diversity in our thoughts and behaviors. However, the perception of pain is easier than the fleeting feeling of happiness and paradoxically, an obsessive desire for pleasure or an inability to endure pain are conducive to pain, not pleasure.",
      "ratings": "4.4 out of 5",
      "author": "Anil Rajput holds a bachelor of technology degree from IIT Bombay. He has worked with Goldman Sachs, J. P. Morgan, and Merrill Lynch. He lives in Sydney, Australia."
    },
    {
      "buylink": "https://www.amazon.in/Patanjalis-Yoga-Sutras-Swami-Vivekananda/dp/9389567351/ref=sr_1_21_sspa?keywords=books+for+fitness&qid=1665490210&qu=eyJxc2MiOiIxLjk5IiwicXNhIjoiMC44MSIsInFzcCI6IjAuMDAifQ%3D%3D&sr=8-21-spons&psc=1&spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUEyM1o2UkE1STM4Q0JVJmVuY3J5cHRlZElkPUEwMzA3MTg5MzFQQ1dSNlBRWFo2TSZlbmNyeXB0ZWRBZElkPUEwMzIwMzE3Mk5YMURXRFhDUEU2RCZ3aWRnZXROYW1lPXNwX2J0ZiZhY3Rpb249Y2xpY2tSZWRpcmVjdCZkb05vdExvZ0NsaWNrPXRydWU=",
      "bookcover": "https://m.media-amazon.com/images/I/51b8mwSEc1S._SX460_BO1,204,203,200_.jpg",
      "bookname": "Patanjali’s Yoga Sutras",
      "bookdetails": "Yoga is restraining the mind-stuff from taking various forms. Patanjali’s yoga sutras, written almost two millennia ago, is a comprehensive text on the theory and practice of yoga. From concentration, its spiritual uses and practice, to manifestation and the process of attaining liberation, the aphorisms state the path to self-realization. One of the key texts of classical yoga, this edition of Patanjali’s yoga sutras is a translation by Swami Vivekananda. It includes the Sanskrit text, its transliteration, and translation followed by an in-depth commentary of each sutra.",
      "ratings": "4.5 out of 5",
      "author": "Born Narendranath Datta (1863-1902) in Calcutta, capital of British India, Swami Vivekananda belonged to a traditional aristocratic Bengali Kayastha family. Spiritual from an early age, Vivekananda was fascinated by wandering monks and used to practise meditation. He met Ramakrishna in around 1882. It came about as a life-changing experience for him and he eventually became his notable disciple. After Ramakrishna’s death, Vivekananda, along with other disciples, set up the Ramakrishna Math at Baranagar. In December 1886, they all took monastic vows. It was then that he took the name ‘Swami Vivekananda’. He played a major role in introducing yoga and the Vedanta philosophies to the West. It is because of him that Hinduism gained the status of a major world religion. His birthday is observed as the National Youth Day in India and the day he delivered his famous speech at the Parliament of World Religions, September 11, is commemorated as the World Brotherhood Day."
    },
    {
      "buylink": "https://www.amazon.in/Honey-Its-about-Six-Pack-Transformation/dp/1638866236/ref=sr_1_22_sspa?keywords=books+for+fitness&qid=1665490210&qu=eyJxc2MiOiIxLjk5IiwicXNhIjoiMC44MSIsInFzcCI6IjAuMDAifQ%3D%3D&sr=8-22-spons&psc=1&spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUEyM1o2UkE1STM4Q0JVJmVuY3J5cHRlZElkPUEwMzA3MTg5MzFQQ1dSNlBRWFo2TSZlbmNyeXB0ZWRBZElkPUEwNjM3MjgwM09IRTA5NDhaMkZGViZ3aWRnZXROYW1lPXNwX2J0ZiZhY3Rpb249Y2xpY2tSZWRpcmVjdCZkb05vdExvZ0NsaWNrPXRydWU=",
      "bookcover": "https://m.media-amazon.com/images/I/41Agp3uBW3L._SX311_BO1,204,203,200_.jpg",
      "bookname": "Honey, It’s Not about Six-Pack Abs",
      "bookdetails": "Do you stand in that trial room of a fashion clothing store, looking at a pic of a model in a poster telling yourself, “Gosh! I wish I had that body!”? Or are you that person who wakes up every morning, gung-ho about going for your workouts and then just can’t go for it? Or are you that person who tells yourself, “I can’t do this” Or are you confused on how to begin? Or are you someone, who makes a New Year's resolution to get fit and drops out after a while? Don’t get bogged down. This book is meant just for you because the pre-requisite of getting fit and leading a healthy lifestyle has got nothing to do with what you do, but it’s got everything to do with what’s in your mind. In this book, you will go through the FOUR STAGES to a complete health transformation and help you formulate your own fitness blueprint to easily make fitness a part of the minutiae of your everyday life. The 4 stages are - Stage 1: Setting your Identity Blueprint-that will help you get the right mindset in place. Stage 2: Lock-n-load your mental arsenal–that will give you tools to keep you mentally fit. Stage 3: Unlock Yourself-here you will get to know how to take charge of your life by gaining control of your excuses, habits, and dreams. Stage 4: Get down to brass tacks – this is the real deal to get you physically fit. As there is a frantic rush to get fit by ‘sporting six-pack abs’ this book nudges that notion aside and focuses on the long-term benefits of having the right mindset and consciously working towards a healthy lifestyle.",
      "ratings": "4.6 out of 5",
      "author": ""
    },
    {
      "buylink": "https://www.amazon.in/Strength-Training-Anatomy-Frederic-Delavier/dp/0736092269/ref=sr_1_21?keywords=books+for+fitness&qid=1665491486&qu=eyJxc2MiOiIxLjk5IiwicXNhIjoiMC44MSIsInFzcCI6IjAuMDAifQ%3D%3D&sr=8-21",
      "bookcover": "https://m.media-amazon.com/images/I/51GKL1qnj1L._SX384_BO1,204,203,200_.jpg",
      "bookname": "Strength Training Anatomy",
      "bookdetails": "",
      "ratings": "",
      "author": ""
    },
    {
      "buylink": "https://www.amazon.in/Everyday-Ayurveda-Daily-Habits-Change/dp/8184004575/ref=sr_1_22?keywords=books+for+fitness&qid=1665491486&qu=eyJxc2MiOiIxLjk5IiwicXNhIjoiMC44MSIsInFzcCI6IjAuMDAifQ%3D%3D&smid=A1WYWER0W24N8S&sr=8-22",
      "bookcover": "https://m.media-amazon.com/images/I/51g4BaBeszS._SX328_BO1,204,203,200_.jpg",
      "bookname": "Everyday Ayurveda",
      "bookdetails": "Everyday Ayurveda is the perfect lifestyle guide designed to maximize health, longevity, and happiness the natural way.Do you sometimes feel tired, lethargic and spiritless? How can Ayurveda help in a simple, practisable manner?Time is scarce and precious in today's world, and we seek solutions that are quick. While allopathic medicine tends to focus on the management of disease, the ancient study of dinacharya provides us with holistic knowledge of preventing disease and eliminating its root cause. Taking us through a day in the life of Ayurveda living, Dr Bhaswati Bhattacharya illustrates the core principles of Ayurveda and shows us how to incorporate these in our routine. She explains the logic behind the changes she recommends and how they benefit us. Informative and accessible, Everyday Ayurveda is the perfect lifestyle guide designed to maximize health, longevity and happiness the natural way.Praise for Everyday Ayurveda'Dr Bhaswati has written a book that will help resurrect the knowledge I grew up on, using scientific logic for modern scientists, and slokas for ancient scientists and observers. Her writing will appeal to the intelligent seeker dedicated to achieving a good life using conscious self-care, attention to healthy habits and respect for the wisdom of the ancients.' - Shashi Tharoor, member of parliament 'Bhaswati combines her talents as a healer with passion for sharing truly healing medicine. She has written from the song in her heart that celebrates light, sound and connection with nature.' - Pandits Rajan and Sajan Misra, Padma Bhushan recipients and classical Hindustani vocalists of the Banaras Gharana 'Bhaswati is uniquely able to diagnose like good medical doctors of the past, watching the patient rather than the test result. With a person-centered approach, this book is a tribute to Ayurveda and explains why we should pay more attention to the signals our bodies give us.' - Ashok H. Advani, founder publisher, The Business India Group'Bhaswati has preserved the Sanskrit from which dinacharya emanates. Through her unending curiosity and dedication as a well-trained physician, scientist and professor, she has brought basic concepts of Ayurveda to light. She has toiled and delved deeply with engaging clarity, a fine mind and an extraordinarily connected soul. She teaches Ayurveda authentically because it is in her heart.' - Dr Vd. Chandrabhushan Jha, former dean, faculty of Ayurveda, Banaras Hindu University and professor emeritus of Rasa Shastra'Ancient Ayurvedic rishis developed dinacharya, a way of maintaining normal body rhythms and staying healthy. Assisted by logic and personal accounts, Dr Bhaswati brings dinacharya alive in this book and reinforces its importance and necessity, especially in busy lives.' - Vd. Partap Chauhan, founder of Jiva Ayurveda 'Dr Bhaswati unlocks the age-old tenets of Ayurveda contained in cryptic Sanskrit verses. Her strong roots in tradition and willingness to branch out to the modern world make this book precious, like any true vidya.' - Dr. PR Krishnakumar, Padma Shree recipient and managing director, Arya Vaidya Pharmacy (Coimbatore)'As a fellow Fulbright Scholar, I have witnessed Dr Bhaswati devote her life to researching and preserving Ayurveda, and bringing it back to the hands and hearts of people.' - Gautam Gandhi, former head of new business development, Google India",
      "ratings": "4.3 out of 5",
      "author": "Living between Manhattan and Kashi, Dr Bhaswati Bhattacharya is a licensed, board-certified physician, integrating 'Good Medicine' with Ayurveda for the past fifteen years. She is Clinical Assistant Professor of Family Medicine at Weill Cornell Medical College and a PhD researcher in Ayurveda at Banaras Hindu University. She is a 2014 senior Fulbright-Nehru Scholar, recipient of American Medical Association's Leadership Award and the first Indian to speak at Commencement Exercises at Harvard University. Her work is featured in the documentary, Healers: Journey into Ayurveda, on The Discovery Channel. Her website is: www.drbhaswati.com."
    }
  ]